Repository: yamarten/atproto-website
Catalog: translation/omegat/project_save.tmx
Source language: en_us
Languages: ja

source: This provides the `lex` command, which you can use to install Lexicons into a local project:
ja: これにより`lex`コマンドが提供され、ローカルプロジェクトにLexiconをインストールできます。

source: This read-after-write behavior *only* applies to records from the user making the request. Records from other users that happen to be on the same PDS will not affect the requesting user's response.
ja: このread-after-write動作は、リクエストを行ったユーザーからのレコードに*のみ*適用されます。偶然同じPDS上に存在するだけの他のユーザーからのレコードは、要求側ユーザーの応答に影響を与えません。

source: This reply will be sorted into a hidden section at the bottom of your thread and will mute notifications for subsequent replies - both for yourself and others.
ja: この返信はスレッドの一番下にある非表示のセクションに移動され、その後のあなたや他のユーザー宛の返信の通知をミュートします。

source: This request is authenticated by a JWT signed by the user's repo signing key
ja: このリクエストはユーザーのリポジトリ署名キーで署名されたJWTで認証されます

source: This section is aimed at developers building applications on AT Protocol. Applications with their own end-user login flow should implement [OAuth](#what-is-oauth) for authentication. Single-purpose applications such as bots or command line tools may use [password authentication](/guides/sdk-auth) instead.
ja: このセクションはATプロトコルでアプリケーションを構築している開発者を対象としています。独自のログインフローを持つアプリケーションは認証に[OAuth](#what-is-oauth)を実装すべきです。ボットやコマンドラインツールなどの単一目的のアプリケーションは[パスワード認証](/guides/sdk-auth)を使うこともできます。

source: This section is aimed at developers building applications on Atproto. Applications with their own end-user login flow should implement [OAuth](#what-is-oauth) for authentication. Single-purpose applications such as bots or command line tools may use [password authentication](/guides/sdk-auth) instead.
ja: このセクションはatprotoでアプリケーションを構築している開発者を対象としています。独自のログインフローを持つアプリケーションは認証に[OAuth](#what-is-oauth)を実装すべきです。ボットやコマンドラインツールなどの単一目的のアプリケーションは[パスワード認証](/guides/sdk-auth)を使うこともできます。

source: This separation of roles is intended to provide users with choice between multiple interoperable providers, while also scaling to large network sizes.
ja: この役割の分離は、ユーザーが複数の相互運用可能なプロバイダーの中から選択できるようにすると同時に、大規模なネットワークサイズにもスケールできるようにすることを目的としています。

source: This service has not provided terms of service or a privacy policy.
ja: このサービスには、利用規約もプライバシーポリシーもありません。

source: This should create a domain record at:
ja: これにより以下にドメインレコードが作成されるはずです：

source: This should only take a few minutes.
ja: これには数分かかるはずです。

source: This structure is probably best exemplified by the schema language of atproto: Lexicon. Unlike other approaches to interoperation which attempt to create a generalized way of expressing properties on data (RDF) or to translate data between different domains to facilitate interoperation (lenses), Lexicon provides a way to determine if two things are speaking the same language, and to give a very structured mechanism for ensuring that the data is formatted properly.
ja: この構造は、おそらくatprotoのスキーマ言語であるLexiconに最もよく表れています。RDFのようにデータ上の属性を一般化して表現しようとする手法や、Lensのように異なるドメイン間でデータを翻訳して相互運用を実現しようとする手法とは異なり、Lexiconは二者が同じ言語を話しているかを判断する方法と、データが正しく整形されていることを保証するための非常に構造化された仕組みを提供します。

source: This token is included as part of a call to `com.atproto.identity.signPlcOperation` on the old PDS, along with the requested DID fields (new signing key, rotation keys, PDS location, etc). The old PDS will validate the request, sign using the PDS-managed PLC rotation key, and return the signed PLC operation. The operation will not have been submitted to any PLC directory at this point in time.
ja: このトークンは、要求するDIDのフィールド（新しい署名鍵、ローテーション鍵、PDSの場所など）とともに旧PDS上の`com.atproto.identity.signPlcOperation`呼び出しの一部として含まれます。旧PDSは要求を検証し、PDSが管理するPLCローテーション鍵で署名したPLC操作を返します。この時点ではオペレーションはまだPLCディレクトリに提出されていません。

source: This tutorial builds on top of the app created in our [OAuth with NextJS Tutorial](/guides/oauth-tutorial). You should have a completed NextJS OAuth app before starting this tutorial. If you want to skip that step, you can clone the completed OAuth app from the [Cookbook](https://github.com/bluesky-social/nextjs-oauth-tutorial/tree/129cf28b4146ae709e0dac43ce20154ab5237559).
ja: このチュートリアルは、[NextJSでOAuthチュートリアル](/guides/oauth-tutorial)で作成したアプリをベースに進めます。開始前にNextJS OAuthアプリを完成させておいてください。この手順を省略したい場合は、[Cookbook](https://github.com/bluesky-social/nextjs-oauth-tutorial/tree/129cf28b4146ae709e0dac43ce20154ab5237559)から完成版をクローンできます。

source: This tutorial involves building a TypeScript application from scratch. You should have a working understanding of TypeScript and Node.js.
ja: このチュートリアルでは、TypeScriptアプリケーションをゼロから構築します。TypeScriptとNode.jsの基本的な理解を前提としています。

source: This user does not have a display name, and therefore cannot be verified.
ja: このユーザーには表示名がないため認証できません。

source: This user doesn't have any followers.
ja: このユーザーにはフォロワーがいません。

source: This user has blocked you
ja: このユーザーはあなたをブロックしています

source: This user has blocked you. You cannot view their content.
ja: このユーザーはあなたをブロックしているため、あなたはこのユーザーのコンテンツを閲覧できません。

source: This user has requested that their content only be shown to signed-in users.
ja: このユーザーは自分のコンテンツをサインインしたユーザーにのみ表示するように求めています。

source: This user is included in the <0>{0}</0> list which you have blocked.
ja: このユーザーはブロックした<0>{0}</0>リストに含まれています。

source: This user is included in the <0>{0}</0> list which you have muted.
ja: このユーザーはミュートした<0>{0}</0>リストに含まれています。

source: This user is new here. Press for more info about when they joined.
ja: 新しいユーザーです。ここを押すといつ参加したかの情報が表示されます。

source: This user isn't following anyone.
ja: このユーザーは誰もフォローしていません。

source: This verifies that a user is logged in, creates a lex `Client` with their OAuth session, and then creates a new `xyz.statusphere.status` record with the submitted status text.
ja: この処理では、ユーザーのログイン状態を確認し、OAuthセッションからlexの`Client`を作成し、送信されたステータステキストで`xyz.statusphere.status`レコードを新規作成します。

source: This way, the `StatusPicker` will highlight the user's current status when the page loads.
ja: これにより、ページ読み込み時に`StatusPicker`がユーザーの現在ステータスをハイライトします。

source: This will delete "{0}" from your muted words. You can always add it back later.
ja: ミュートしたワードから「{0}」が削除されます。あとでいつでも戻すことができます。

source: This will generate TypeScript types for the Lexicons in your project. You can use this `import` statement to access all installed Lexicons:
ja: これによりプロジェクト内にLexicon用のTypeScriptの型が生成されます。インストールしたLexiconには`import`文でアクセスできます。

source: This will give you access to the API methods for your Lexicons. Now you are ready to start [making requests](/guides/reading-data)!
ja: これによりLexiconのAPIメソッドにアクセスできるようになります。これで[リクエストを行う](/guides/reading-data)準備が整いました！

source: This will give you access to the API methods for your Lexicons. Now you are ready to start [making requests](/guides/reading-data)! </TabPanel> <TabPanel value="go"> ```go import ( "context" appbsky "github.com/bluesky-social/indigo/api/bsky" comatproto "github.com/bluesky-social/indigo/api/atproto" lexutil "github.com/bluesky-social/indigo/lex/util" "github.com/bluesky-social/indigo/xrpc" )
ja: これによりLexiconのAPIメソッドにアクセスできるようになります。これで[リクエストを行う](/guides/reading-data)準備が整いました。 </TabPanel> <TabPanel value="go"> ```go import ( "context" appbsky "github.com/bluesky-social/indigo/api/bsky" comatproto "github.com/bluesky-social/indigo/api/atproto" lexutil "github.com/bluesky-social/indigo/lex/util" "github.com/bluesky-social/indigo/xrpc" )

source: This will produce Typescript interfaces as well as runtime validation functions that we can use in our app. Here's what that generated code looks like:
ja: これにより、アプリで使用できるTypescriptインターフェースと実行時検証関数が生成されます。生成されたコードは次のようになります。

source: This will remove @{0} from the quick access list.
ja: クイックアクセスのリストから@{0}を削除します。

source: This will remove your post from this quote post for all users, and replace it with a placeholder.
ja: これによってあなたの投稿が全員に見える引用投稿からは削除され、プレースホルダーに置き換えられます。

source: This will serve a [client metadata document](/specs/oauth#client-id-metadata-document).
ja: これで[client metadata document](/specs/oauth#client-id-metadata-document)を配信できます。

source: This {screenDescription} has been flagged:
ja: この{screenDescription}にはフラグが設定されています：

source: Thread Preferences
ja: スレッドの設定

source: Thread options
ja: スレッドのオプション

source: Thread preferences
ja: スレッドの設定

source: Threaded
ja: スレッド

source: Threads Preferences
ja: スレッドの設定

source: Threats or incitement
ja: 脅迫または扇動

source: Time remaining: {0, plural, one {# second} other {# seconds}}
ja: 残り時間：{0, plural, other {#秒}}

source: To change the requested scope, update the SCOPE constant in `lib/auth/client.ts`. It should be a space-delimited string:
ja: 要求するスコープを変更するには、`lib/auth/client.ts`のSCOPE定数を更新します。スペース区切り文字列で指定します。

source: To create a PDS account with an existing identity, it is necessary to prove control the identity.
ja: 既存IDを使ってPDSアカウントを作成するには、そのIDを自分が制御していると証明する必要があります。

source: To create a new record, call `client.create()` with an imported Lexicon, along with any required fields:
ja: 新しいレコードの作成には、Lexiconをインポートした`client.create()`に必要なフィールドを添えて呼び出します。

source: To delete a record, like an individual post, use `client.delete()`:
ja: 個々の投稿などのレコードを削除するには、`client.delete()`を使用します。

source: To disable the email 2FA method, please verify your access to the email address.
ja: メールでの2要素認証を無効にするには、メールアドレスにアクセスできるか確認してください。

source: To disable your email 2FA method, please verify your access to <0>{0}</0>
ja: メールでの2要素認証を無効にするには、<0>{0}</0>にアクセスできるか確認してください

source: To do this, we just update `POST /status` to include an additional write to our SQLite DB:
ja: これを行うには、SQLite DBへの追加の書き込みを含めるように`POST /status`を更新するだけです。

source: To do this, you'll implement a [confidential client](/specs/oauth#types-of-clients). Your Next.js server will hold credentials for talking to a user's PDS. The server will verify incoming requests from the browser using cookies for session auth.
ja: これをするために[機密クライアント](/specs/oauth#types-of-clients)を実装します。Next.jsサーバーがユーザーのPDSと通信するための資格情報を保持し、ブラウザからのリクエストをクッキーでセッション認証して検証します。

source: To fix this, we need to write programs which generate precomputed views of our dataset. These views are essentially like cached queries. We even duplicate the canonical data into these views so they're very fast.
ja: これを修正するには、データセットの事前計算済みビューを生成するプログラムを作成する必要があります。これらのビューは、本質的にはキャッシュされたクエリのようなものです。これらのビューに標準データを複製して、非常に高速にします。

source: To implement OAuth in your application, refer to [OAuth patterns](/guides/oauth-patterns) for common use cases, and the [Scopes](/guides/scopes) guide for understanding permission models. If you're building your own protocol implementation or OAuth Client SDK, refer to the [OAuth spec](/specs/oauth).
ja: アプリケーションにOAuthを実装するには、一般的なユースケースについては[OAuthパターン](/guides/oauth-patterns)を、権限モデルの理解については[スコープガイド](/guides/scopes)を参照してください。独自のプロトコル実装またはOAuthクライアアントSDKを構築している場合は、[OAuth仕様](/specs/oauth)を参照してください。

source: To include labels from a given labeler, set the `atproto-accept-labelers` header on an XRPC request to a comma-separated list of the DIDs of the labelers you want to include, like so:
ja: 特定のラベラーからのラベルを含めるには、XRPCリクエストの`atproto-accept-labelers`ヘッダーを、含めたいラベラーのDIDのカンマ区切りリストに設定します。

source: To listen for activity across the network, you [sync from relays](/guides/sync). You could sync directly from the users' PDSes, but it's more convenient to use the relays. Since all data is signed, you can confirm the relay's stream is accurate.
ja: ネットワーク全体のアクティビティを監視するには、[リレーから同期](/guides/sync)します。ユーザーのPDSから直接同期することもできますが、リレーを使う方が便利です。すべてのデータには署名があるため、リレーのストリームが正確か検証できます。

source: To log out, <0>click here</0>.
ja: ログアウトするには、<0>ここをクリック</0>。

source: To make API requests, you'll need to specify a particular [Lexicon](/guides/lexicon). For example, Bluesky posts are available under the `app.bsky.feed.post` Lexicon.
ja: APIリクエストを行うには、特定の[Lexicon](/guides/lexicon)を指定する必要があります。例えば、Blueskyの投稿は`app.bsky.feed.post` Lexicon で提供されます。

source: To report a conversation, please report one of its messages via the conversation screen. This lets our moderators understand the context of your issue.
ja: 会話を報告するには、会話の画面からメッセージのうちの一つを報告してください。それによって問題の文脈をモデレーターが理解できるようになります。

source: To send a report to a Labeler, use the `com.atproto.moderation.createReport` procedure. Users may send reports to any of their labelers.
ja: ラベラーに報告を送信するには、`com.atproto.moderation.createReport`を使用します。ユーザーはどのラベラーにでも報告を送信できます。

source: To solve this, we introduce an event log (such as [Kafka](https://kafka.apache.org/)). That log records and broadcasts all the changes to the NoSQL cluster. Our view servers listen to &mdash; and replay &mdash; that log to ensure they never miss an update, even when they need to restart.
ja: この問題を解決するために、イベントログ（[Kafka](https://kafka.apache.org/)など）を導入します。このログは、NoSQLクラスターへのすべての変更を記録してブロードキャストします。ビューサーバーは、再起動が必要な場合でも更新を見逃さないように、このログをリッスンして再生します。

source: To specify which labeler should receive the label, set the `atproto-proxy` header with the DID of the labeler and the service key of `atproto_labeler`. In the TypeScript SDK, it looks like this:
ja: どのラベラーがラベルを受け取るべきかを指定するには、ラベラーのDIDと`atproto_labeler`サービスキーを`atproto-proxy`ヘッダーを設定します。TypeScript SDKでは、次のようになります。

source: To update an existing record, like a user's profile, use `client.put()`:
ja: ユーザーのプロフィールなど既存のレコードを更新するには、`client.put()`を使用します。

source: Today
ja: 今日

source: Toggle to enable or disable adult content
ja: 成人向けコンテンツの有効もしくは無効の切り替え

source: Toggles the sound
ja: 音の切り替え

source: Tokens provide an extension mechanism, and work well for values that have subjective definitions or may be expanded over time
ja: トークンは拡張メカニズムを提供し、主観的な定義を持つ値や時間とともに拡張される可能性のある値に適しています

source: Too many attempts. Please wait a few minutes and try again.
ja: 試行回数が多すぎます。数分後にもう一度お試しください。

source: Too many codes sent. Please wait a few minutes and try again.
ja: 送信されたコードが多すぎます。数分後にもう一度やり直してください。

source: Too many contacts - you've exceeded the number of contacts you can import to find your friends
ja: 連絡先が多すぎます。友達を見つけるためにインポートできる連絡先の数を超えています

source: Top
ja: トップ

source: Top replies first
ja: トップの返信を最初に

source: Topic
ja: トピック

source: Translate
ja: 翻訳

source: Tree view
ja: ツリー表示

source: Trending
ja: トレンド

source: Trending Videos
ja: 話題のビデオ

source: Trolling
ja: トローリング（荒らし）

source: Trust emerges from relationships, communities, and shared context, so we’re also enabling <0>trusted verifiers</0>: organizations that can directly issue verification.
ja: 信頼は人間関係、コミュニティ、共有されている文脈から得られるため、<0>信頼できる認証者</0>（認証を直接発行できる組織）を有効にしています。

source: Try a different search term, or <0>read about how to use search filters</0>.
ja: 他の単語で検索を試してください。または、<0>検索フィルタの使い方を読んでください</0>。

source: Try again
ja: 再試行

source: Two-factor authentication (2FA)
ja: 2要素認証（2FA）

source: Type your message here
ja: ここにメッセージを入力する

source: Type:
ja: タイプ：

source: Unable to access location. You'll need to visit your system settings to enable location services for Bluesky.
ja: 位置情報にアクセスできません。システムの設定を確認して、位置情報サービスをBlueskyが使えるよう許可する必要があります。

source: Unable to connect. Please check your internet connection and try again.
ja: 接続できません。インターネットへの接続を確認して再度試してください。

source: Unable to contact your service. Please check your Internet connection.
ja: あなたのサービスに接続できません。インターネットの接続を確認してください。

source: Unable to contact your service. Please check your internet connection and try again.
ja: サービスに接続できません。インターネットの接続を確認してください。

source: Unable to delete
ja: 削除できません

source: Unapply Pull Request
ja: プルリクエストを適用しない

source: Unapply Pull Request {currentChannel}
ja: プルリクエスト {currentChannel} を適用しない

source: Unavailable
ja: 利用不可

source: Unavailable feed information
ja: フィードの情報が利用できません

source: Unblock
ja: ブロックを解除

source: Unblock Account?
ja: アカウントのブロックを解除しますか？

source: Unblock account
ja: アカウントのブロックを解除

source: Unblock list
ja: リストのブロックを解除

source: Understanding account lifecycles also helps understand record deletions in AT Protocol.
ja: アカウントライフサイクルを理解することは、ATプロトコルにおけるレコード削除の理解の助けにもなります。

source: Undo
ja: 元に戻す

source: Undo repost
ja: リポストを元に戻す

source: Undo repost ({0, plural, one {# repost} other {# reposts}})
ja: リポストを元に戻す（{0, plural, other {#件のリポスト}}）

source: Unfollow account
ja: アカウントのフォローを解除

source: Unfollow {0}
ja: {0}のフォローを解除

source: Unfollows the user
ja: ユーザーのフォローを解除

source: Unfortunately, none of your subscribed labelers supports this report type.
ja: 残念ながら、登録しているラベラーはどれもこのタイプの報告をサポートしていません。

source: Unfortunately, the birthdate you have saved to your profile makes you too young to access Bluesky.
ja: 残念ながら、あなたがプロフィールに設定した生年月日は、Blueskyにアクセスするには若すぎます。

source: Unknown verifier
ja: 不明な認証

source: Unlabeled adult content
ja: ラベルのない成人向けコンテンツ

source: Unlabeled, abusive, or non-consensual adult content
ja: ラベルなし、虐待的、または合意のない成人向けコンテンツ

source: Unlike
ja: いいねを外す

source: Unlike ({0, plural, one {# like} other {# likes}})
ja: いいねを外す（{0, plural, other {#件のいいね}}）

source: Unmute
ja: ミュートを解除

source: Unmute account
ja: アカウントのミュートを解除

source: Unmute conversation
ja: 会話のミュートを解除

source: Unmute list
ja: リストのミュートを解除

source: Unmute thread
ja: スレッドのミュートを解除

source: Unmute video
ja: ビデオのミュートを解除

source: Unmute {tag}
ja: {tag} のミュートを解除

source: Unpin
ja: ピン留めを解除

source: Unpin Feed
ja: フィードのピン留めを外す

source: Unpin feed
ja: フィードのピン留めを外す

source: Unpin from home
ja: ホームからピン留めを解除

source: Unpin from profile
ja: プロフィールから固定を解除

source: Unpin moderation list
ja: モデレーションリストのピン留めを解除

source: Unpinned from your feeds
ja: フィードからピン留めを解除

source: Unpinned list
ja: リストのピン留めを解除しました

source: Unpinned {0} from Home
ja: {0}のピン留めを解除しました

source: Unsnooze email reminder
ja: メールのリマインダーのスヌーズを解除

source: Unsubscribe
ja: 登録を解除

source: Unsubscribe from list
ja: リストの登録を解除

source: Unsubscribe from this labeler
ja: このラベラーの登録を解除

source: Unsubscribed from list
ja: リストの登録を解除しました

source: Unsupported video type: {mimeType}
ja: サポートしていないビデオ形式：{mimeType}

source: Update
ja: 更新する

source: Update <0>{displayName}</0> in Lists
ja: リストの<0>{displayName}</0>を更新

source: Update `app/page.tsx` again to fetch and pass the current user's status:
ja: `app/page.tsx`を再度更新し、現在ユーザーのステータスを取得して渡すようにします。

source: Update `lib/db/index.ts` to add new tables:
ja: `lib/db/index.ts`を更新して新しいテーブルを追加します。

source: Update email
ja: メールアドレスの更新

source: Update to {domain}
ja: {domain}に更新

source: Update your DNS configuration as you would for any other server, then change the domain name in `pds.env`.
ja: 他のサーバーでやるようにDNS設定を更新し、その後`pds.env`内のドメイン名を変更してください。

source: Update your email
ja: メールアドレスの更新

source: Updating quote attachment failed
ja: 引用の添付の更新に失敗しました

source: Updating reply visibility failed
ja: 返信の表示設定の更新に失敗しました

source: Updating...
ja: 更新中…

source: Upload a photo instead
ja: 代わりに写真をアップロード

source: Upload a text file to:
ja: テキストファイルのアップロード先：

source: Upload from Camera
ja: カメラからアップロード

source: Upload from Files
ja: ファイルからアップロード

source: Upload from Library
ja: ライブラリーからアップロード

source: Uploaded on {0}
ja: {0}にアップロードしました

source: Uploading images...
ja: 画像をアップロード中…

source: Uploading link thumbnail...
ja: リンクのサムネイルをアップロード中…

source: Uploading video...
ja: ビデオをアップロード中…

source: Use [Litestream with systemd](https://litestream.io/guides/systemd/) or another scheduler to find the most recently updated DBs and back them up. By default, individual user databases are located in `/pds/actors/`. Litestream will clean the write-ahead log and checkpoint automatically, so there's no risk of WAL growing out of control.
ja: [Litestreamとsystemd](https://litestream.io/guides/systemd/)または別のスケジューラーを使用して、直近で更新されたDBを見つけてバックアップします。デフォルトでは、個々のユーザーデータベースは`/pds/actors/`に配置されます。Litestreamはライトアヘッドログとチェックポイントを自動的にクリーンアップするため、WALが制御不能に増加するリスクはありません。

source: Use `lex` to install the `app.bsky.feed.post` and `app.bsky.actor.profile` Lexicons as described in [Installing Lexicons](/guides/installing-lexicons):
ja: [Lexiconのインストール](/guides/installing-lexicons)に記載の通り、`lex`を使って`app.bsky.feed.post`と`app.bsky.actor.profile`のLexiconをインストールしてください。

source: Use app passwords to sign in to other Bluesky clients without giving full access to your account or password.
ja: アプリパスワードを使うことで、アカウントやパスワードに完全にアクセスする権限を与えることなく、他のBlueskyクライアントにサインインします。

source: Use default provider
ja: デフォルトプロバイダーを使用

source: Use in-app browser
ja: アプリ内ブラウザを使用

source: Use in-app browser to open links
ja: リンクを開く時にアプリ内ブラウザを使用

source: Use my default browser
ja: デフォルトのブラウザを使用

source: Use recommended
ja: おすすめを使う

source: Use singular nouns for `record` schemas
ja: `record`スキーマには単数形の名詞を使用してください

source: Use this to sign in to the other app along with your handle.
ja: ハンドルと一緒にこのパスワードを使用して、他のアプリにサインインします。

source: Use your account email address, or another real email address you control, in case KWS or Bluesky needs to contact you.
ja: KWSまたはBlueskyがあなたに連絡する必要がある場合に備えて、あなたが持っているアカウントの電子メールアドレスまたは別の実際の電子メールアドレスを使用してください。

source: Use “subscribe-plural-noun” for `subscription`
ja: `subscription`には「subscribe-複数形名詞」を使用してください

source: Use “verb-noun” for `query` and `procedure` endpoints
ja: `query`と`procedure`エンドポイントには動詞と名詞を使用してください

source: User Blocked
ja: ブロック中のユーザー

source: User Blocked by "{0}"
ja: 「{0}」によってブロックされたユーザー

source: User Blocked by List
ja: リストによってブロック中のユーザー

source: User Blocking You
ja: あなたをブロックしているユーザー

source: User Blocks You
ja: あなたをブロックしているユーザー

source: User blocked
ja: ユーザーをブロックしました

source: User blocked by list
ja: リストによってブロック中のユーザー

source: User controls such as mutes and blocks
ja: ミュートやブロックなどのユーザーコントロール

source: User data is exchanged in [signed data repositories](/guides/data-repos). These repositories are collections of records which include posts, comments, likes, follows, etc.
ja: ユーザーデータは、[署名付きデータリポジトリ](/guides/data-repos)で交換されます。これらのリポジトリは、投稿、コメント、いいね、フォローなどを含むレコードのコレクションです。

source: User data is stored in [signed data repositories](/guides/data-repos) and authenticated by [DIDs](/guides/identity). Signed data repositories are like Git repos but for database records, and DIDs provide a directory of cryptographic keys, similar in some ways to the TLS certificate system. Identities are expected to be secure, reliable, and independent of the user's PDS.
ja: ユーザーデータは[署名付きデータリポジトリ](/guides/data-repos)に保存され、[DID](/guides/identity)によって検証されます。名付きデータリポジトリはデータベースレコード用のGitリポジトリに似たもので、DIDはTLS証明書システムのようなユーザー証明書のレジストリと喩えられます。これらは安全で信頼性が高く、ユーザーのPDSから独立していることが期待されます。

source: User data is stored in signed data repositories and verified by DIDs. Signed data repositories are like Git repos but for database records, and DIDs are essentially registries of user certificates, similar in some ways to the TLS certificate system. They are expected to be secure, reliable, and independent of the user's PDS.
ja: ユーザーデータは署名付きデータリポジトリに保存され、DIDによって検証されます。署名付きデータリポジトリはデータベースレコード用のGitリポジトリに似たもので、DIDはTLS証明書システムのようなユーザー証明書のレジストリと喩えられます。これらは安全で信頼性が高く、ユーザーのPDSから独立していることが期待されます。

source: User list by you
ja: あなたの作成したユーザーリスト

source: User list by {0}
ja: <0/>の作成したユーザーリスト

source: User list created
ja: ユーザーリストを作成しました

source: User list updated
ja: ユーザーリストを更新しました

source: Username cannot be longer than {MAX_SERVICE_HANDLE_LENGTH, plural, other {# characters}}
ja: ユーザー名は{MAX_SERVICE_HANDLE_LENGTH, plural, other {#文字}}までです

source: Username cannot begin or end with a hyphen
ja: ユーザー名はハイフンで始まったり終わったりできません

source: Username must only contain letters (a-z), numbers, and hyphens
ja: ユーザー名はアルファベット(a-z)、数字、ハイフンのみ使用できます

source: Username or email address
ja: ユーザー名またはメールアドレス

source: Users I follow
ja: フォローしているユーザー

source: Users in AT Protocol have permanent decentralized identifiers (DIDs) for their accounts. They also have a configurable domain name, which acts as a human-readable handle. Identities include a reference to the user's current hosting provider and cryptographic keys.
ja: ATプロトコルユーザーは、自分のアカウントに対して永続的な分散型識別子（DID）を持ちます。また、人間可読なハンドルとして機能する構成可能なドメイン名も持っています。IDにはユーザーの現在のホスティングプロバイダーと暗号鍵への参照が含まれます。
